[
  {
    "id": 1,
    "title": "Frontend Developer Intern",
    "companyName": "Tech Solutions Inc.",
    "location": "Remote",
    "type": "Internship",
    "minCgpa": 7.5,
    "shortDescription": "Join our frontend team to build amazing user interfaces.",
    "description": "This is a 3-month remote internship. You will be working with our core frontend team on developing new features for our flagship product. \n\nResponsibilities:\n- Collaborate with designers and backend developers to implement new UI features.\n- Write clean, maintainable, and well-documented code using React and Tailwind CSS.\n- Participate in code reviews and contribute to our growing component library.\n- Troubleshoot and debug issues to ensure a smooth user experience.\n\nQualifications:\n- Strong understanding of HTML, CSS, and modern JavaScript (ES6+).\n- Experience with React.js.\n- Familiarity with state management libraries (e.g., Redux, Zustand) is a plus.\n- Basic understanding of REST APIs.\n\nAdditional Information:\n- Duration: 3 months with potential for extension based on performance.\n- Stipend: Competitive with a completion certificate.\n- Tools: You will work with GitHub, Figma, and JIRA for project tracking.\n- Mentorship: Regular sessions with senior frontend developers.",
    "skills": ["React", "Tailwind", "JavaScript", "HTML", "CSS"],
    "eligibility": "Currently pursuing a degree in Computer Science or a related field.",
    "deadline": "2025-11-30",
    "postedBy": 101,
    "approved": true,
    "createdAt": "2025-10-01T09:00:00Z"
  },
  {
    "id": 2,
    "title": "Data Analyst Intern",
    "companyName": "Data Insights Co.",
    "location": "New York, NY",
    "type": "Full-time",
    "minCgpa": 8.0,
    "shortDescription": "Analyze large datasets and generate valuable insights.",
    "description": "Data Insights Co. is looking for a motivated Data Analyst Intern to join our team in New York. You will work on real-world business problems and assist our data science team in making data-driven decisions.\n\nResponsibilities:\n- Assist in data collection, cleaning, and preprocessing from various sources.\n- Perform exploratory data analysis to identify trends and patterns.\n- Create dashboards and visualizations to communicate findings to stakeholders.\n- Collaborate with the team on larger data science projects.\n\nQualifications:\n- Proficient in Python and its data analysis libraries (Pandas, NumPy).\n- Strong knowledge of SQL for data querying.\n- Experience with data visualization tools like Matplotlib, Seaborn, or Tableau.\n- Excellent analytical and problem-solving skills.\n\nAdditional Information:\n- Duration: 6 months full-time in New York office.\n- Exposure: Work on real datasets from finance and retail sectors.\n- Tools: Tableau, Power BI, and Google Data Studio.\n- Opportunity: High-performing interns may receive full-time offers.",
    "skills": ["Python", "SQL", "Pandas", "NumPy", "Tableau"],
    "eligibility": "Final year students with good analytical skills.",
    "deadline": "2025-12-15",
    "postedBy": 101,
    "approved": true,
    "createdAt": "2025-10-20T12:00:00Z"
  },
  {
    "id": 3,
    "title": "Backend Engineer Intern",
    "companyName": "Server Systems LLC",
    "location": "San Francisco, CA",
    "type": "Internship",
    "minCgpa": 7.0,
    "shortDescription": "Work on our scalable backend services.",
    "description": "As a Backend Engineer Intern at Server Systems LLC, you will have the opportunity to work on the core infrastructure that powers our services. This is a unique chance to gain hands-on experience with scalable systems and cloud technologies.\n\nWhat You Will Do:\n- Design, develop, and maintain RESTful APIs using Node.js and Express.\n- Work with our database systems (MongoDB) to ensure data integrity and performance.\n- Write unit and integration tests to ensure the reliability of our services.\n- Learn about and contribute to our CI/CD pipeline and cloud deployment processes on AWS.\n\nWho You Are:\n- A student pursuing a degree in Computer Science, Software Engineering, or a related field.\n- You have a solid foundation in programming and computer science fundamentals.\n- You are familiar with backend technologies, including Node.js and a database system.\n- You are eager to learn and have a passion for building scalable and reliable software.\n\nAdditional Information:\n- Duration: 4 months, with an option to transition to a full-time role.\n- Mentorship: Direct guidance from senior backend engineers.\n- Exposure: Work with microservices architecture and containerized deployments.\n- Tools: AWS, Docker, Jenkins, and MongoDB Atlas.",
    "skills": ["Node.js", "Express", "MongoDB", "REST APIs", "AWS"],
    "eligibility": "B.Tech students familiar with backend tech stack.",
    "deadline": "2025-12-10",
    "postedBy": 102,
    "approved": false,
    "createdAt": "2025-09-28T15:00:00Z"
  },
  {
    "id": 4,
    "title": "UX/UI Designer Intern",
    "companyName": "Creative Minds Studio",
    "location": "Chicago, IL",
    "type": "Internship",
    "minCgpa": 7.0,
    "shortDescription": "Design intuitive and beautiful user experiences.",
    "description": "Join our design team to create stunning and user-friendly interfaces for our mobile and web applications.",
    "skills": ["Figma", "UI/UX", "Prototyping"],
    "eligibility": "Students with a strong portfolio in UI/UX design.",
    "deadline": "2025-12-05",
    "postedBy": 102,
    "approved": true,
    "createdAt": "2025-10-15T11:00:00Z"
  },
  {
    "id": 5,
    "title": "DevOps Engineer",
    "companyName": "Tech Solutions Inc.",
    "location": "Remote",
    "type": "Full-time",
    "minCgpa": 8.0,
    "shortDescription": "Manage and automate our cloud infrastructure.",
    "description": "We are looking for a DevOps engineer to help us build and maintain our CI/CD pipelines and cloud infrastructure on AWS.",
    "skills": ["AWS", "Docker", "Kubernetes", "CI/CD"],
    "eligibility": "Final year students or recent graduates with relevant experience.",
    "deadline": "2025-11-25",
    "postedBy": 101,
    "approved": true,
    "createdAt": "2025-10-05T18:00:00Z"
  }
]
